app/Controllers/PaqueteController.php

    public function index() {
        $paquetes = $this->paqueteModel->findAll();
---
SELECT *
FROM `paquetes`

    public function show($id) {
        $paquete = $this->paqueteModel->find($id);
---
SELECT *
FROM `paquetes`
WHERE `paquetes`.`id` = '1'

    public function edit($id) {
        $paquete = $this->paqueteModel->find($id);
---
SELECT *
FROM `paquetes`
WHERE `paquetes`.`id` = '1'